/*===============================================================================*/
/*============ Найти среднее арифметические трёхзначного числа ==================*/
/*===============================================================================*/

/*=============================================================================== */
/*================================= переменные ================================== */
/*=============================================================================== */
int input=0;  //входная переменная
int result=0; //результат
int input_data_not_ok=1; //данные введены корректно

while (input_data_not_ok==1)
{
    try
    {
        Console.Clear();
        Console.Write("Введите целое трёх значное число :");
        input=Convert.ToInt32(Console.ReadLine());
        if (input<100) //не трёхзначное число
        {
            input_data_not_ok=1;
        }
        else
        {
            input_data_not_ok=0;
        }
    }
    catch (SystemException) //если это не integer
    {
        input_data_not_ok=1;
    }
}
//нахождение среднего арифметического
result = input/100;
result = (result%100)/10;

result=(input/100 + (input % 100)/10 + (input % 100) % 10)/3;
//вывод результата
Console.Write($"Среднее арифметическое значение числа {input} равно {result}");