/*==================================================================================================================
1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
a = 25, b = 5 -> да 
a = 2, b = 10 -> нет
a = 9, b = -3 -> да 
a = -3 b = 9 -> нет
==================================================================================================================*/

/*============================================================================================== */
/*========================================== переменные ======================================== */
/*============================================================================================== */
double numer1=0.0;        //первое число
double numer2=0.0;        //второе число
int input_data_not_ok=1;  //данные введены корректно

/*============================================================================================== */
/*================================ ввод исходных данных ======================================== */
/*============================================================================================== */
while (input_data_not_ok==1)
{
    Console.Clear();
    try
    {
        Console.WriteLine("Введите первое число: ");
        numer1=Convert.ToDouble(Console.ReadLine());
        Console.Clear();
        
        Console.WriteLine("Введите второе число: ");
        numer2=Convert.ToDouble(Console.ReadLine());
        Console.Clear();

        //защита от дурака, только положительные скорости и расстояния
        input_data_not_ok=0;
        if ((numer1<0) && (numer2!=0.0))
        {
            input_data_not_ok=1;
             Console.WriteLine("Неправильный ввод данных");
        }
    }
    catch (SystemException) //если ввели не те типы
    {
        input_data_not_ok=1;
        Console.WriteLine("Неправильный ввод данных");
    }
}

if ((numer1/numer2)==numer2)
{
    //положительный исход
    Console.WriteLine($"Первое число {numer1} является квадратом числа {numer2}");
}
else
{
    //отрицательный исход
    Console.WriteLine($"Первое число {numer1} не является квадратом числа {numer2}");
}