
/*====================================================================================
2. Напишите программу, которая будет выдавать название дня недели по заданному номеру.
3 -> Среда 
5 -> Пятница
================================================================================*/

/*============================================================================================== */
/*========================================== переменные ======================================== */
/*============================================================================================== */
double input=0.0;        //нумер недели цифровой
int input_data_not_ok=1;  //данные введены корректно

/*============================================================================================== */
/*================================ ввод исходных данных ======================================== */
/*============================================================================================== */
while (input_data_not_ok==1)
{
    Console.Clear();
    try
    {
        Console.WriteLine("Введите число дня недели: ");
        input=Convert.ToDouble(Console.ReadLine());
        Console.Clear();
        input_data_not_ok=0;
        //защита от дурака, только положительные скорости и расстояния
    }
    catch (SystemException) //если ввели не те типы
    {
        input_data_not_ok=1;
        Console.WriteLine("Номер дня недели может быть лишь 1..7");
    }
}

switch (input)
{
    case 1.0:
        Console.WriteLine("1 - Сегодня понедельник?");
        break;
    case 2.0:
        Console.WriteLine("2 - Сегодня вторник?");
        break;
    case 3.0:
        Console.WriteLine("3 - Сегодня среда?");
        break;
    case 4.0:
        Console.WriteLine("4 - Сегодня четверг?");
        break;
    case 5.0:
        Console.WriteLine("5 - Сегодня пятница?");
        break;
    case 6.0:
        Console.WriteLine("6 - Сегодня суббота?");
        break;
    case 7.0:
        Console.WriteLine("7 - Сегодня воскресенье?");
        break;    
    default:
        Console.WriteLine("Номер дня недели может быть лишь 1..7");
        break;
}