/*====================================================================================
Ввод целого числа, затем вывод значений от - N до N
================================================================================*/

/*============================================================================================== */
/*========================================== переменные ======================================== */
/*============================================================================================== */
double input=0.0;        //нумер недели цифровой
double result=0.0;       //промежуточная переменная для результата
int input_data_not_ok=1; //данные введены корректно

/*============================================================================================== */
/*================================ ввод исходных данных ======================================== */
/*============================================================================================== */

Console.Clear();
Console.Write("Введите целое число: ");
while (input_data_not_ok==1)
{
    try
    {
        input = Convert.ToDouble(Console.ReadLine());
        input_data_not_ok=0;
    }
    catch (SystemException)
    {
        input_data_not_ok=1;
    }
}
input = Math.Abs(input); //только положительные числа
result = -input; //начальное значение для 
//вывод результата
while(result <= input)
{
 Console.Write($" {result}");
 result = result+1.0;
}
